const 
    qaMotoList = [
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?1', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    }
                ]
        },
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?2', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    }
                ]
        },
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?3', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    }
                ]
        },
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?4', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    }
                ]
        },
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?5', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    }
                ]
        },
    ],
    qaAutoList = [
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?1', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    }
                ]
        },
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?2', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    }
                ]
        },
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?3', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    }
                ]
        },
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?4', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    }
                ]
        },
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?5', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    }
                ]
        },
    ],
    qaTruckList = [
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?1', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    }
                ]
        },
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?2', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    }
                ]
        },
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?3', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    }
                ]
        },
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?4', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    }
                ]
        },
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?5', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    }
                ]
        },
    ],
    qaTrailerList = [
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?1', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    }
                ]
        },
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?2', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    }
                ]
        },
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?3', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    }
                ]
        },
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?4', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    }
                ]
        },
        {   
            question:'Разрешен ли обгон впереди движующегося Т/С?5', 
            answersList:[   
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:true
                    },
                    {   answer:`
                            Текст Текст Текст Текст Текст Текст Текст 
                            Текст Текст Текст Текст Текст Текст Текст
                            Текст Текст Текст Текст Текст Текст Текст
                        `, status:false
                    }
                ]
        },
];
let qaArray = [];
$('.container .rules-button').on('click',function(){
    $('.rules-wrapper,.mask').fadeIn();
});
$('.container .rules-wrapper .rules-close').on('click',function(){
    $('.rules-wrapper, .mask').fadeOut();
});
$('#Moto, #Auto, #Truck, #Trailer').on('click',function(){
    if(!$(this).parent().hasClass('locked'))
    {
        $('.mask').fadeIn();
        refreshQuestion(this.id, 0);
        qaArray = [];
        $('.qa-wrapper').fadeIn();
    }
});
$('.qa-wrapper .button-next').on('click',function(){
    var status = false,
        answer = false;
    $('.question-item').each(function(index,item){
        if($(this).hasClass('active'))
        {
            status = true;
            answer = $(this).attr('data-answer');
        }
    });
    if(status == true)
    {
        let currentIter = $('.qa-wrapper').attr('data-iterator');
        let currentIndex = parseInt($('.qa-wrapper').attr('data-question')); 
        qaArray.push(answer);
        currentIndex++;
        if(currentIndex!= 5)
        {
            refreshQuestion(currentIter, currentIndex);
        }
        else
        {
            let final = 0;
            $(qaArray).each(function(index,item){
                if(item == 'true')
                {
                    final++;
                }
            });
            if(final >= 4)
            {
                $('.container .qa-wrapper .notification').text(`Вы прошли экзамен! Оценка - ${final}`).fadeIn();
            }
            else
            {
                $('.container .qa-wrapper .notification').text(`Вы завалили экзамен! Оценка - ${final}`).fadeIn();
            }
            setTimeout(function(){
                $('.container .qa-wrapper .notification, .container .qa-wrapper, .container .mask').fadeOut();
            },1700);
            showVerdict(currentIter,final);
        }
    }
    else
    {
        $('.container .qa-wrapper .notification').text('Вы не выбрали ответ').fadeIn();
        setTimeout(function(){
            $('.container .qa-wrapper .notification').fadeOut();
        },1200);
    }
});
function showVerdict(currentIter,final)
{
    $(`#${currentIter}`).parent().find('.status-item').each(function(index,item)
    {
        if(index < final)
        {
            $(item).addClass('active');
        }
        else
        {
            $(item).removeClass('active');
        }
    });
}
function refreshQuestion(currentIter, currentIndex)
{
    $('.qa-wrapper .qa-question').text(eval(`qa${currentIter}List`)[currentIndex].question);
    $('.qa-wrapper .question-count').text(parseInt(currentIndex)+1);    
    $('.qa-wrapper .qa-wrap').empty();
    $('.qa-wrapper').attr('data-question',currentIndex).attr('data-iterator',currentIter);    
    $(eval(`qa${currentIter}List`)[currentIndex].answersList).each(function(index,item){
        let template = `<div class="question-item" data-answer="${item.status}">
                            <div class="trigger"></div>
                            <div class="question-text">
                                ${item.answer}
                            </div>
                        </div>`;
        $('.qa-wrapper .qa-wrap').append(template);
    });
    $('.qa-wrap .question-item').on('click',function(){
        $('.qa-wrap .question-item.active').removeClass('active');
        $(this).addClass('active');
    });
}