let operationRooms = {
    'Аптека':
    {
        'Аптека':
        [
            'цетиризин',
            'амоксицилин',
            'парацетамол',
            'поливитамины',
            'маннитол',
            'абсорбент',
            'нитроглицерин',
            'эсмолол',
            'фениндион',
            'фосфатидил',
            'левамизол',
            'цетиризин'
        ]
    },
    'Операционная':{
        'удаление инородного тела':[
            'правая кисть',
            'правое предплечье',
            'правое плечо',
            'правая стопа',
            'правая голень',
            'правое бедро',
            'левая кисть',
            'левое предплечье',
            'левое плечо',
            'левая стопа',
            'левая голень',
            'левое бедро',
            'торс',
            'голова',
            'ключица',
            'таз'
        ],
        'удаление зараженных тканей':[
            'правая кисть',
            'правое предплечье',
            'правое плечо',
            'правая стопа',
            'правая голень',
            'правое бедро',
            'левая кисть',
            'левое предплечье',
            'левое плечо',
            'левая стопа',
            'левая голень',
            'левое бедро',
            'торс',
            'голова',
            'ключица',
            'таз'
        ],        
        'наложение швов':[
            'правая кисть',
            'правое предплечье',
            'правое плечо',
            'правая стопа',
            'правая голень',
            'правое бедро',
            'левая кисть',
            'левое предплечье',
            'левое плечо',
            'левая стопа',
            'левая голень',
            'левое бедро',
            'торс',
            'голова',
            'ключица',
            'таз'
        ],
        'переливание крови': null,
        'операция на печень': null,
        'операция на легкие': null,
        'операция на сердце': null,
        'операция на почку': null,
        'трепанация черепа': null,
        'цетиризин' : null        
    },
    'Перевязочная':{
        'гипс':[            
            'правая кисть',
            'правое предплечье',
            'правое плечо',
            'правая стопа',
            'правая голень',
            'правое бедро',
            'левая кисть',
            'левое предплечье',
            'левое плечо',
            'левая стопа',
            'левая голень',
            'левое бедро',
            'торс',
            'голова',
            'ключица',
            'таз'
        ],
        'шина':[
            'правая кисть',
            'правое предплечье',
            'правое плечо',
            'правая стопа',
            'правая голень',
            'правое бедро',
            'левая кисть',
            'левое предплечье',
            'левое плечо',
            'левая стопа',
            'левая голень',
            'левое бедро',
            'торс',
            'голова',
            'ключица',
            'таз'
        ],
        'бинт':[
            'правая кисть',
            'правое предплечье',
            'правое плечо',
            'правая стопа',
            'правая голень',
            'правое бедро',
            'левая кисть',
            'левое предплечье',
            'левое плечо',
            'левая стопа',
            'левая голень',
            'левое бедро',
            'торс',
            'голова',
            'ключица',
            'таз'
        ],        
        'наложение швов':[
            'правая кисть',
            'правое предплечье',
            'правое плечо',
            'правая стопа',
            'правая голень',
            'правое бедро',
            'левая кисть',
            'левое предплечье',
            'левое плечо',
            'левая стопа',
            'левая голень',
            'левое бедро',
            'торс',
            'голова',
            'ключица',
            'таз'
        ],
        'троксерутин':[
            'правая кисть',
            'правое предплечье',
            'правое плечо',
            'правая стопа',
            'правая голень',
            'правое бедро',
            'левая кисть',
            'левое предплечье',
            'левое плечо',
            'левая стопа',
            'левая голень',
            'левое бедро',
            'торс',
            'голова',
            'ключица',
            'таз'
        ],
        'хлорамфеникол':[
            'правая кисть',
            'правое предплечье',
            'правое плечо',
            'правая стопа',
            'правая голень',
            'правое бедро',
            'левая кисть',
            'левое предплечье',
            'левое плечо',
            'левая стопа',
            'левая голень',
            'левое бедро',
            'торс',
            'голова',
            'ключица',
            'таз'
        ],
        'цетиризин' : null    
    },
    'Приемная':
    {
        'цефазолин':[
            'внутримышечно',
            'правая кисть',
            'правое предплечье',
            'правое плечо',
            'правая стопа',
            'правая голень',
            'правое бедро',
            'левая кисть',
            'левое предплечье',
            'левое плечо',
            'левая стопа',
            'левая голень',
            'левое бедро',
            'торс',
            'голова',
            'ключица',
            'таз'
        ],
        'нимесулид':[
            'внутримышечно',
            'правая кисть',
            'правое предплечье',
            'правое плечо',
            'правая стопа',
            'правая голень',
            'правое бедро',
            'левая кисть',
            'левое предплечье',
            'левое плечо',
            'левая стопа',
            'левая голень',
            'левое бедро',
            'торс',
            'голова',
            'ключица',
            'таз'
        ],        
        'дисульфирам':[
            'внутримышечно'
        ],
        'рисперидон':[
            'внутримышечно'
        ],
        'цетиризин':null,
        'амоксицилин':null,
        'парацетомол':null,
        'поливитамины':null,
        'маннитол':null,
        'абсорбент':null,
        'нитроглицерин':null,
        'эсмолол':null,
        'фениндион':null,
        'фосфатидил':null,
        'левамизол':null,
        'метадон':null,
        'клофелин':null,
        'цетиризин':null            
    },
    'Процедурная':
    {
        'Процедурная':[
            'глюкоза',
            'изотонический раствор',
            'инфузионная терапия',
            'переливание крови'
        ], 
        'физиотерапия':[
            'внутримышечно',
            'торс'
        ],
        'цетиризин' : null    
    }
};
function pushRoom(name)
{
    let currentObj = operationRooms[name];
    $('.container .title').text(name);
    $('.container .wrapper .list-wrapper').empty();
    for (let key in currentObj)
    {
        console.log(key,currentObj[key]);
        if(name == key)
        {
            $(currentObj[key]).each(function(index,item){
                let template = `
                    <div class="list-elem" data-name="">${item}</div>
                `;
                $('.container .wrapper .list-wrapper').append(template);
            });
        }
        else
        {
            let template = ``;
            $(currentObj[key]).each(function(index,item){
                template += `
                    <div class="list-elem" data-name="${key}">${item}</div>
                `;
            });
            let wrapper = `<div class="list-wrap">
                <div class="list-title ${currentObj[key] == null ? `clickable" data-name="${name}` : 'slidable'}">${key}${currentObj[key] == null ? '' : '<i class="fas fa-arrow-down"></i>'}</div>
                <div class="inner-wrap">${template}</div>
            </div>`;
            $('.container .wrapper .list-wrapper').append(wrapper);
        }
    }
    refreshList();
}
function refreshList()
{
    $('.container .wrapper .list-wrapper .list-title.slidable').on('click',function(){
        if($(this).next().is(':visible'))
        {
            $(this).removeClass('opened');
            $(this).next().slideUp();
        }
        else
        {
            $(this).addClass('opened');
            $(this).next().slideDown();
        }
    });
    $('.container .wrapper .list-wrapper .list-elem, .container .wrapper .list-wrapper .list-title.clickable').on('click',function(){
        let elem = $(this).text(),
            title = $(this).attr('data-name');
        console.log(elem,title);
        if($(this).hasClass('clickable'))
        {
            console.log('chooseOperation','',elem);
            mp.trigger('chooseOperation','',elem);
        }
        else
        {
            console.log('chooseOperation',title,elem);
            mp.trigger('chooseOperation',title,elem);
        } 
    });
    $('.container .close-but').on('click',function(){
        mp.trigger('closeOperationsMenu');
    });
}