let wardrobeMaleList = [
        {
            name:'Комплект ПД м 1',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м руки',
                'Рубашка м рация ПД'
            ]
        },
        {
            name:'Комплект ПД м 2',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м руки',
                'Рубашка м кобура и пояс ПД'
            ]
        },
        {
            name:'Комплект ПД м 3',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м руки',
                'Рубашка м пояс ПД'
            ]
        },
        {
            name:'Комплект ПД м 4',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м руки',
                'Рубашка м кобура ПД'
            ]
        },
        {
            name:'Комплект ПД м 5',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м руки',
                'Рубашка м бронежилет ПД'
            ]
        },
        {
            name:'Комплект ПД м 6',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м автоперчатки',
                'Рубашка м рация ПД'
            ]
        },
        {
            name:'Комплект ПД м 7',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м автоперчатки',
                'Рубашка м кобура и пояс ПД'
            ]
        },
        {
            name:'Комплект ПД м 8',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м автоперчатки',
                'Рубашка м пояс ПД'
            ]
        },
        {
            name:'Комплект ПД м 9',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м автоперчатки',
                'Рубашка м кобура ПД'
            ]
        },
        {
            name:'Комплект ПД м 10',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м автоперчатки',
                'Рубашка м бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД м 11',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м кожаные перчатки',
                'Рубашка м рация ПД'
            ]
        },	
        {
            name:'Комплект ПД м 12',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м кожаные перчатки',
                'Рубашка м кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 13',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м кожаные перчатки',
                'Рубашка м пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 14',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м кожаные перчатки',
                'Рубашка м кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД м 15',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м кожаные перчатки',
                'Рубашка м бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД м 16',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м белые перчатки',
                'Рубашка м рация ПД'
            ]
        },	
        {
            name:'Комплект ПД м 17',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м белые перчатки',
                'Рубашка м кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 18',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м белые перчатки',
                'Рубашка м пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 19',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м белые перчатки',
                'Рубашка м кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД м 20',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м белые перчатки',
                'Рубашка м бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД м 21',
            clothes: [
                'Куртка м форма ПД',
                'Торс м руки',
                'Рубашка м рация ПД'
            ]
        },	
        {
            name:'Комплект ПД м 22',
            clothes: [
                'Куртка м форма ПД',
                'Торс м руки',
                'Рубашка м кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 23',
            clothes: [
                'Куртка м форма ПД',
                'Торс м руки',
                'Рубашка м пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 24',
            clothes: [
                'Куртка м форма ПД',
                'Торс м руки',
                'Рубашка м кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД м 25',
            clothes: [
                'Куртка м форма ПД',
                'Торс м руки',
                'Рубашка м бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД м 26',
            clothes: [
                'Куртка м форма ПД',
                'Торс м автоперчатки',
                'Рубашка м рация ПД'
            ]
        },	
        {
            name:'Комплект ПД м 27',
            clothes: [
                'Куртка м форма ПД',
                'Торс м автоперчатки',
                'Рубашка м кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 28',
            clothes: [
                'Куртка м форма ПД',
                'Торс м автоперчатки',
                'Рубашка м пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 29',
            clothes: [
                'Куртка м форма ПД',
                'Торс м автоперчатки',
                'Рубашка м кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД м 30',
            clothes: [
                'Куртка м форма ПД',
                'Торс м автоперчатки',
                'Рубашка м бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД м 31',
            clothes: [
                'Куртка м форма ПД',
                'Торс м кожаные перчатки',
                'Рубашка м рация ПД'
            ]
        },	
        {
            name:'Комплект ПД м 32',
            clothes: [
                'Куртка м форма ПД',
                'Торс м кожаные перчатки',
                'Рубашка м кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 33',
            clothes: [
                'Куртка м форма ПД',
                'Торс м кожаные перчатки',
                'Рубашка м пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 34',
            clothes: [
                'Куртка м форма ПД',
                'Торс м кожаные перчатки',
                'Рубашка м кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД м 35',
            clothes: [
                'Куртка м форма ПД',
                'Торс м кожаные перчатки',
                'Рубашка м бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД м 36',
            clothes: [
                'Куртка м форма ПД',
                'Торс м белые перчатки',
                'Рубашка м рация ПД'
            ]
        },	
        {
            name:'Комплект ПД м 37',
            clothes: [
                'Куртка м форма ПД',
                'Торс м белые перчатки',
                'Рубашка м кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 38',
            clothes: [
                'Куртка м форма ПД',
                'Торс м белые перчатки',
                'Рубашка м пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 39',
            clothes: [
                'Куртка м форма ПД',
                'Торс м белые перчатки',
                ''
            ]
        },	
        {
            name:'Комплект ПД м 40',
            clothes: [
                'Куртка м форма ПД',
                'Торс м белые перчатки',
                'Рубашка м бронежилет ПД'
            ]
        }
    ],
    wardrobeFemaleList = [
        {
            name:'Комплект ПД ж 1',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж руки 3',
                'Рубашка ж рация ПД'
            ]
        },
        {
            name:'Комплект ПД ж 2',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж руки 3',
                'Рубашка ж кобура и пояс ПД'
            ]
        },
        {
            name:'Комплект ПД ж 3',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж руки 3',
                'Рубашка ж пояс ПД'
            ]
        },
        {
            name:'Комплект ПД ж 4',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж руки 3',
                'Рубашка ж кобура ПД'
            ]
        },
        {
            name:'Комплект ПД ж 5',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж руки 3',
                'Рубашка ж бронежилет ПД'
            ]
        },
        {
            name:'Комплект ПД ж 6',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж автоперчатки 3',
                'Рубашка ж рация ПД'
            ]
        },
        {
            name:'Комплект ПД ж 7',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж автоперчатки 3',
                'Рубашка ж кобура и пояс ПД'
            ]
        },
        {
            name:'Комплект ПД ж 8',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж автоперчатки 3',
                'Рубашка ж пояс ПД'
            ]
        },
        {
            name:'Комплект ПД ж 9',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж автоперчатки 3',
                'Рубашка ж кобура ПД'
            ]
        },
        {
            name:'Комплект ПД ж 10',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж автоперчатки 3',
                'Рубашка ж бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 11',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж кожаные перчатки 3',
                'Рубашка ж рация ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 12',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж кожаные перчатки 3',
                'Рубашка ж кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 13',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж кожаные перчатки 3',
                'Рубашка ж пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 14',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж кожаные перчатки 3',
                'Рубашка ж кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 15',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж кожаные перчатки 3',
                'Рубашка ж бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 16',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж белые перчатки 3',
                'Рубашка ж рация ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 17',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж белые перчатки 3',
                'Рубашка ж кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 18',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж белые перчатки 3',
                'Рубашка ж пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 19',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж белые перчатки 3',
                'Рубашка ж кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 20',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж белые перчатки 3',
                'Рубашка ж бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 21',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж руки 11',
                'Рубашка ж рация ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 22',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж руки 11',
                'Рубашка ж кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 23',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж руки 11',
                'Рубашка ж пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 24',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж руки 11',
                'Рубашка ж кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 25',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж руки 11',
                'Рубашка ж бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 26',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж автоперчатки 11',
                'Рубашка ж рация ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 27',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж автоперчатки 11',
                'Рубашка ж кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 28',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж автоперчатки 11',
                'Рубашка ж пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 29',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж автоперчатки 11',
                'Рубашка ж кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 30',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж автоперчатки 11',
                'Рубашка ж бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 31',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж кожаные перчатки 11',
                'Рубашка ж рация ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 32',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж кожаные перчатки 11',
                'Рубашка ж кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 33',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж кожаные перчатки 11',
                'Рубашка ж пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 34',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж кожаные перчатки 11',
                'Рубашка ж кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 35',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж кожаные перчатки 11',
                'Рубашка ж бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 36',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж белые перчатки 11',
                'Рубашка ж рация ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 37',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж белые перчатки 11',
                'Рубашка ж кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 38',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж белые перчатки 11',
                'Рубашка ж пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 39',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж белые перчатки 11',
                ''
            ]
        },	
        {
            name:'Комплект ПД ж 40',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж белые перчатки 11',
                'Рубашка ж бронежилет ПД'
            ]
        }
    ];
function pushWardrobe(sex)
{
    if(sex == 'man')
    {
        sex = 'Male';
    }
    else if(sex == 'girl')
    {
        sex = 'Female'
    }
    $('.container .wardrobe-wrapper').empty();
    $(eval(`wardrobe${sex}List`)).each(function(index,item){
        let template = `
            <div class="wardrobe-item" id="${sex}" data-index="${index}">
                <div class="wardrobe-name">${item.name}</div>
                <img src="images/inventory/Clothes_Duty.png" alt="">
            </div>`;
        $('.container .wardrobe-wrapper').append(template);
    });
    initWardrobe();
}
function initWardrobe()
{
    $('.wardrobe-item').on('click',function(){
        if(!$(this).hasClass('closed'))
        {
            if($(this).hasClass('active'))
            {
                $(this).removeClass('active');
                $('.button#use').addClass('disabled');
            }
            else
            {
                $('.button#use').removeClass('disabled');
                $('.wardrobe-item.active').removeClass('active');
                $(this).addClass('active');
            }
        }
    });
    $('.button#use').on('click',function(){
        if($('.wardrobe-item.active').length != 0)
        {
            let sex = $('.wardrobe-item.active')[0].id,
                activeWardrobe = $(eval(`wardrobe${sex}List`))[$('.wardrobe-item.active').attr('data-index')];      
            $('.button#use').addClass('disabled');
            $('.wardrobe-wrapper .active').removeClass('active');
            console.log(activeWardrobe);
            mp.trigger('LspdUseWardrobe',activeWardrobe);
        }
    });
    $('.button#close').on('click',function(){
        mp.trigger('closePoliceWardrobe');
    });
    
}