let wardrobeMaleSetList = [
        {
            name:'Комплект ПД м 1',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м руки',
                'Рубашка м рация ПД'
            ]
        },
        {
            name:'Комплект ПД м 2',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м руки',
                'Рубашка м кобура и пояс ПД'
            ]
        },
        {
            name:'Комплект ПД м 3',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м руки',
                'Рубашка м пояс ПД'
            ]
        },
        {
            name:'Комплект ПД м 4',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м руки',
                'Рубашка м кобура ПД'
            ]
        },
        {
            name:'Комплект ПД м 5',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м руки',
                'Рубашка м бронежилет ПД'
            ]
        },
        {
            name:'Комплект ПД м 6',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м автоперчатки',
                'Рубашка м рация ПД'
            ]
        },
        {
            name:'Комплект ПД м 7',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м автоперчатки',
                'Рубашка м кобура и пояс ПД'
            ]
        },
        {
            name:'Комплект ПД м 8',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м автоперчатки',
                'Рубашка м пояс ПД'
            ]
        },
        {
            name:'Комплект ПД м 9',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м автоперчатки',
                'Рубашка м кобура ПД'
            ]
        },
        {
            name:'Комплект ПД м 10',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м автоперчатки',
                'Рубашка м бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД м 11',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м кожаные перчатки',
                'Рубашка м рация ПД'
            ]
        },	
        {
            name:'Комплект ПД м 12',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м кожаные перчатки',
                'Рубашка м кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 13',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м кожаные перчатки',
                'Рубашка м пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 14',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м кожаные перчатки',
                'Рубашка м кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД м 15',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м кожаные перчатки',
                'Рубашка м бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД м 16',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м белые перчатки',
                'Рубашка м рация ПД'
            ]
        },	
        {
            name:'Комплект ПД м 17',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м белые перчатки',
                'Рубашка м кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 18',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м белые перчатки',
                'Рубашка м пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 19',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м белые перчатки',
                'Рубашка м кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД м 20',
            clothes: [
                'Куртка м свитер ПД',
                'Торс м белые перчатки',
                'Рубашка м бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД м 21',
            clothes: [
                'Куртка м форма ПД',
                'Торс м руки',
                'Рубашка м рация ПД'
            ]
        },	
        {
            name:'Комплект ПД м 22',
            clothes: [
                'Куртка м форма ПД',
                'Торс м руки',
                'Рубашка м кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 23',
            clothes: [
                'Куртка м форма ПД',
                'Торс м руки',
                'Рубашка м пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 24',
            clothes: [
                'Куртка м форма ПД',
                'Торс м руки',
                'Рубашка м кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД м 25',
            clothes: [
                'Куртка м форма ПД',
                'Торс м руки',
                'Рубашка м бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД м 26',
            clothes: [
                'Куртка м форма ПД',
                'Торс м автоперчатки',
                'Рубашка м рация ПД'
            ]
        },	
        {
            name:'Комплект ПД м 27',
            clothes: [
                'Куртка м форма ПД',
                'Торс м автоперчатки',
                'Рубашка м кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 28',
            clothes: [
                'Куртка м форма ПД',
                'Торс м автоперчатки',
                'Рубашка м пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 29',
            clothes: [
                'Куртка м форма ПД',
                'Торс м автоперчатки',
                'Рубашка м кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД м 30',
            clothes: [
                'Куртка м форма ПД',
                'Торс м автоперчатки',
                'Рубашка м бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД м 31',
            clothes: [
                'Куртка м форма ПД',
                'Торс м кожаные перчатки',
                'Рубашка м рация ПД'
            ]
        },	
        {
            name:'Комплект ПД м 32',
            clothes: [
                'Куртка м форма ПД',
                'Торс м кожаные перчатки',
                'Рубашка м кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 33',
            clothes: [
                'Куртка м форма ПД',
                'Торс м кожаные перчатки',
                'Рубашка м пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 34',
            clothes: [
                'Куртка м форма ПД',
                'Торс м кожаные перчатки',
                'Рубашка м кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД м 35',
            clothes: [
                'Куртка м форма ПД',
                'Торс м кожаные перчатки',
                'Рубашка м бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД м 36',
            clothes: [
                'Куртка м форма ПД',
                'Торс м белые перчатки',
                'Рубашка м рация ПД'
            ]
        },	
        {
            name:'Комплект ПД м 37',
            clothes: [
                'Куртка м форма ПД',
                'Торс м белые перчатки',
                'Рубашка м кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 38',
            clothes: [
                'Куртка м форма ПД',
                'Торс м белые перчатки',
                'Рубашка м пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД м 39',
            clothes: [
                'Куртка м форма ПД',
                'Торс м белые перчатки',
                ''
            ]
        },	
        {
            name:'Комплект ПД м 40',
            clothes: [
                'Куртка м форма ПД',
                'Торс м белые перчатки',
                'Рубашка м бронежилет ПД'
            ]
        }
    ],
    wardrobeMaleClothesList = [
        "Низ м брюки ПД",
        "Низ м брюки 2 ПД 1",
        "Аксессуар м значок ПД",
        "Аксессуар м удостоверение ПД",
        "Шляпа м кепка ПД",										
        "Шляпа м шлем с защитой ПД",										
        "Шляпа м шлем с защитой 1 ПД",											
        "Шляпа м шлем с защитой 2 ПД",										
        "Шляпа м шлем с защитой 3 ПД"	
    ],
    wardrobeFemaleSetList = [
        {
            name:'Комплект ПД ж 1',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж руки 3',
                'Рубашка ж рация ПД'
            ]
        },
        {
            name:'Комплект ПД ж 2',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж руки 3',
                'Рубашка ж кобура и пояс ПД'
            ]
        },
        {
            name:'Комплект ПД ж 3',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж руки 3',
                'Рубашка ж пояс ПД'
            ]
        },
        {
            name:'Комплект ПД ж 4',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж руки 3',
                'Рубашка ж кобура ПД'
            ]
        },
        {
            name:'Комплект ПД ж 5',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж руки 3',
                'Рубашка ж бронежилет ПД'
            ]
        },
        {
            name:'Комплект ПД ж 6',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж автоперчатки 3',
                'Рубашка ж рация ПД'
            ]
        },
        {
            name:'Комплект ПД ж 7',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж автоперчатки 3',
                'Рубашка ж кобура и пояс ПД'
            ]
        },
        {
            name:'Комплект ПД ж 8',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж автоперчатки 3',
                'Рубашка ж пояс ПД'
            ]
        },
        {
            name:'Комплект ПД ж 9',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж автоперчатки 3',
                'Рубашка ж кобура ПД'
            ]
        },
        {
            name:'Комплект ПД ж 10',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж автоперчатки 3',
                'Рубашка ж бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 11',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж кожаные перчатки 3',
                'Рубашка ж рация ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 12',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж кожаные перчатки 3',
                'Рубашка ж кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 13',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж кожаные перчатки 3',
                'Рубашка ж пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 14',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж кожаные перчатки 3',
                'Рубашка ж кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 15',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж кожаные перчатки 3',
                'Рубашка ж бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 16',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж белые перчатки 3',
                'Рубашка ж рация ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 17',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж белые перчатки 3',
                'Рубашка ж кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 18',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж белые перчатки 3',
                'Рубашка ж пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 19',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж белые перчатки 3',
                'Рубашка ж кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 20',
            clothes: [
                'Куртка ж свитер ПД',
                'Торс ж белые перчатки 3',
                'Рубашка ж бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 21',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж руки 11',
                'Рубашка ж рация ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 22',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж руки 11',
                'Рубашка ж кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 23',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж руки 11',
                'Рубашка ж пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 24',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж руки 11',
                'Рубашка ж кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 25',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж руки 11',
                'Рубашка ж бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 26',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж автоперчатки 11',
                'Рубашка ж рация ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 27',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж автоперчатки 11',
                'Рубашка ж кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 28',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж автоперчатки 11',
                'Рубашка ж пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 29',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж автоперчатки 11',
                'Рубашка ж кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 30',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж автоперчатки 11',
                'Рубашка ж бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 31',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж кожаные перчатки 11',
                'Рубашка ж рация ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 32',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж кожаные перчатки 11',
                'Рубашка ж кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 33',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж кожаные перчатки 11',
                'Рубашка ж пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 34',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж кожаные перчатки 11',
                'Рубашка ж кобура ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 35',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж кожаные перчатки 11',
                'Рубашка ж бронежилет ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 36',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж белые перчатки 11',
                'Рубашка ж рация ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 37',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж белые перчатки 11',
                'Рубашка ж кобура и пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 38',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж белые перчатки 11',
                'Рубашка ж пояс ПД'
            ]
        },	
        {
            name:'Комплект ПД ж 39',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж белые перчатки 11',
                ''
            ]
        },	
        {
            name:'Комплект ПД ж 40',
            clothes: [
                'Куртка ж форма ПД',
                'Торс ж белые перчатки 11',
                'Рубашка ж бронежилет ПД'
            ]
        }
    ],
    wardrobeFemaleClothesList = [
        "Низ ж брюки ПД",								
        "Низ ж юбка ПД", 
        "Низ ж брюки 2 ПД",    
        "Аксессуар ж значок ПД", 								
        "Аксессуар ж удостоверение ПД", 								
        "Шляпа ж кепкаПД 45", 		
        "Шляпа ж шлем с защитой ПД 122", 						
        "Шляпа ж шлем с защитой 1 ПД 123", 					
        "Шляпа ж шлем с защитой 2 ПД 124", 						
        "Шляпа ж шлем с защитой 3 ПД 125"
    ],
    wardrobeNames = [
        'Низ',
        'Аксессуар',
        'Шляпа'
    ],
    wardrobeNamesTranslated = [
        'Bottom',
        'Accessories',
        'Hat'
    ];
$('.container .wardrobe-wrapper .wardrobe-category-title').on('click',function(){
    if(!$(this).next().is(':visible'))
    {
        $(this).next().slideDown();
        $(this).find('svg').css({
            'transform':'rotate(180deg)'
        });
    }
    else
    {
        $(this).next().slideUp();
        $(this).find('svg').css({
            'transform':'rotate(360deg)'
        });
    }
});
function pushWardrobe(sex)
{
    if(sex == 'man')
    {
        sex = 'Male';
    }
    else if(sex == 'girl')
    {
        sex = 'Female'
    }
    $('.container .wardrobe-wrapper #Set').empty();
    $(eval(`wardrobe${sex}SetList`)).each(function(index,item){
        let template = `
            <div class="wardrobe-item" id="${sex}" data-index="${index}" data-list="wardrobe${sex}SetList">
                <div class="wardrobe-name">${item.name}</div>
                <img src="images/inventory/Clothes_Duty.png" alt="">
            </div>`;
        $('.container .wardrobe-wrapper #Set').append(template);
    });
    $(eval(`wardrobe${sex}ClothesList`)).each(function(index,item){
        $(wardrobeNames).each(function(indexEl,classEl){
            if(item.includes(classEl))
            {
                let template = `
                    <div class="wardrobe-item" id="${sex}" data-index="${index}" data-list="wardrobe${sex}ClothesList">
                        <div class="wardrobe-name">${item}</div>
                        <img src="images/person/${wardrobeNamesTranslated[indexEl]}.png" alt="">
                    </div>`;
                $(`.container .wardrobe-wrapper #${wardrobeNamesTranslated[indexEl]}`).append(template);
            }
        });
    });
    initWardrobe();
}
function initWardrobe()
{
    $('.wardrobe-item').on('click',function(){
        if(!$(this).hasClass('closed'))
        {   
            let id = $(this).parent()[0].id;
            if($(this).hasClass('active'))
            {
                $(this).removeClass('active');
                $('.button#use').addClass('disabled');
            }
            else
            {
                $('.button#use').removeClass('disabled');
                $(`#${id} .wardrobe-item.active`).removeClass('active');
                $(this).addClass('active');
            }
        }
    });
    $('.button#use').on('click',function(){
        if($('.wardrobe-item.active').length != 0)
        {
            let activeList = [];
            $('.wardrobe-item.active').each(function(index,item){
                let element = null;                
                element = $(eval($(item).attr('data-list')));
                if($(this).parent()[0].id != 'Set')
                {
                    element = { name : element[$(item).attr('data-index')], clothes : [ element[$(item).attr('data-index')] ]};
                }
                else
                {
                    element = eval($(item).attr('data-list'))[$(item).attr('data-index')];
                    console.log('Set',element);
                }
                console.log(element);
                activeList.push(element);
            });      
            console.log(activeList);
            $('.button#use').addClass('disabled');
            $('.wardrobe-wrapper .active').removeClass('active');
            $('.container .wardrobe-category-title').next().slideUp();
            $('.container .wardrobe-category-title').find('svg').css({
                'transform':'rotate(360deg)'
            });
            mp.trigger('LspdUseWardrobe',JSON.stringify(activeList));
        }
    });
    $('.button#close').on('click',function(){
        mp.trigger('closePoliceWardrobe');
    });
    
}